#include "msp430g2452.h"
#include "..\Include\TypeDef.h"

/*******************************************************************************\
函数名称：Delay(void)
函数作用：延时
函数参数：无
描述：无
\*******************************************************************************/
void Delay(void)
{
  unsigned char i,j; 
  for (i=0; i< 255; i++)
   {
      for (j=0; j<255; j++);
   }
}

/*******************************************************************************\
函数名称：main(void)
函数作用：主函数
函数参数：无
描述：无
\*******************************************************************************/
void main(void)
{
  // Stop watchdog timer to prevent time out reset
  WDTCTL = WDTPW + WDTHOLD;

  P1DIR |= 0x01;
  while(1)
  {
    P1OUT |= 0x01;
    Delay();
    P1OUT &= ~0x01;
    Delay();
  }
}
 